#Программа Game Over 2
print ("Программа 'Game Over' 2.0")
print ("То же", "самое", "сообщение")
print ("Только",
       "чуть-чуть",
       "побольше")
print ("Вот", end=" ")
print ("оно...")
print (
    """
        _____      ___      __   __    ____
       / ____|    /   |    /  |/   |  | ___|
       | |       / /| |   / /|  /| |  | |__
       | |  _   / __  |  / / |_/ | |  | ___|
       | |_| | / /  | | / /      | |  | |__
       \_____//_/   |_|/_/       |_|  |____|

         _____   _      _   ____   ____
        /  _  \ | |    / / | ___| |  _  \
        | | | | | |   / /  | |__  | |_| |
        | | | | | |  / /   | ___| |  _  /
        | |_| | | |_/ /    | |__  | | \ \
        \ ____/ |____/     |____| |_|  \_\
        
        """
    )
input ("\n\nНажмите Enter, чтобы выйти.")
