# Инструкция
# Демонстрирует, как создавать собственные функции
def instructions():
    """Выводит на экран инструкцию для игрока."""
    print(
        """
        Добро пожаловать на ринг грандиознейших интеллектуальных состязаний все времен.
        Твой мозг и мой процессор в схватке за доской игры "Крестики-нолики".
        Чтобы сделать ход, введи число от 0 до 8. Числа однозначно соответствуют полям доски - так, как показано ниже:
        0 | 1 | 2
        ---------
        3 | 4 | 5
        ---------
        6 | 7 | 8
        Приготовься к бою, жалкий белковый человечишка. Вот-вот начнется решающее сражение.\n
        """
    )
# основная часть
print("\nЭто инструкция для игры в 'Крестики-нолики':")
instructions()
print("Это опять та же самая интрукция:")
instructions()
print("Надеюсь, теперь смысл игры ясен.")
input("\n\nНажмите Enter, чтобы выйти.")