# Пользователь вводит названия двух любимых блюд и получает название нового необычного блюда
print("Ведите название двух ваших любимых блюд")
first_dish = input("Первое блюдо: ")
secont_dish = input("Второе блюдо: ")
print("Новое необычное блюдо будет называться", secont_dish + first_dish)
print("\nНажмите Enter, чтобы выйти")
